[Guardian X2UniversalSoldierClassInfo]
ClassSpecializationTitle="守护女神"
ClassSpecializationSummary="这些士兵是不同品种的医务人员，可以使用改良的小精灵，可以根据需要治疗盟友，以及可以立即使士兵恢复战斗状态的强效注射套件。她们不是白白被昵称为守护天使."

[BattleAngel X2UniversalSoldierClassInfo]
ClassSpecializationTitle="战争女神"
ClassSpecializationSummary="这些士兵使用她们的小精灵与盟友进行交互，实时突出敌人的弱点并因此增强杀伤力。降临节肯定不会发现任何关于她们的天使."

[Valkyrie X2UniversalSoldierClassInfo]
ClassSpecializationTitle="女武神"
ClassSpecializationSummary="这些士兵全身心地投入战斗，虽然她们可能没有我们其她一些专长那么多的能力，但她们可以在一瞬间增强自己，粉碎几乎任何愚蠢到可以抵抗的外星人。."
